{
  "common": {
    "name": "history",
    "title": "History",
    "titleLang": {
      "en": "History",
      "de": "History",
      "ru": "History",
      "pt": "History",
      "nl": "History",
      "fr": "History",
      "it": "History",
      "es": "History",
      "pl": "History",
      "zh-cn": "历史"
    },
    "desc": {
      "en": "Logging of the state history in files",
      "de": "Protokollierung der Zustandsgeschichte in Dateien",
      "ru": "Ведение истории событий в файлах",
      "pt": "Registro do histórico de estado em arquivos",
      "nl": "Logboekregistratie van de statusgeschiedenis in bestanden",
      "fr": "Consignation de l'historique des états dans les fichiers",
      "it": "Registrazione della cronologia di stato nei file",
      "es": "Registro del historial del estado en archivos",
      "pl": "Rejestrowanie historii stanu w plikach",
      "zh-cn": "在文件中记录状态历史记录"
    },
    "version": "2.2.5",
    "news": {
      "2.2.5": {
        "en": "Fix getHistory when aggregations were used in some cases",
        "de": "Bekommen Geschichte, als Aggregate in einigen Fällen verwendet wurden",
        "ru": "Fix получить История, когда агрегации были использованы в некоторых случаях",
        "pt": "Fixar get História quando as agregaçãos foram usadas em alguns casos",
        "nl": "Fix Geschiedenis toen aggregaties werden gebruikt in sommige gevallen",
        "fr": "Fixe. Historique lorsque des agrégations ont été utilisées dans certains cas",
        "it": "Risolvere Storia quando le aggregazioni sono state utilizzate in alcuni casi",
        "es": "Corrección Historia cuando se utilizaron agregaciones en algunos casos",
        "pl": "Fix Historia, gdy agregacja była używana w niektórych przypadkach",
        "uk": "Виправлення Історія при агрегаціях",
        "zh-cn": "固定 在有些情况下使用汇总的历史"
      },
      "2.2.4": {
        "en": "Update for future js-controller versions",
        "de": "Update für zukünftige js-controller Versionen",
        "ru": "Обновление для будущих версий js-controller",
        "pt": "Atualização para futuras versões js-controller",
        "nl": "Update voor toekomstige Js-controller versie",
        "fr": "Update for future js-controller versions",
        "it": "Aggiornamento per future versioni js-controller",
        "es": "Actualización para futuras versiones js-controller",
        "pl": "Wersja js-controllerowa",
        "zh-cn": "B. 今后控制容忍版本的最新情况"
      },
      "2.2.3": {
        "en": "Fix error in history2db converter script",
        "de": "Fehler in history2db Konverter-Skript beheben",
        "ru": "Исправление ошибки в history2db конвертер скрипт",
        "pt": "Corrigir erro no script conversor history2db",
        "nl": "Quality over Quantity (QoQ) Releases Vertaling:",
        "fr": "Erreur fixe dans le script de convertisseur history2db",
        "it": "Risolvere l'errore nella sceneggiatura del convertitore storico2db",
        "es": "Error de fijación en la historia2db convertidor script",
        "pl": "Błąd w historii2db",
        "zh-cn": "A. 历史上2b 转换成文的错误"
      },
      "2.2.1": {
        "en": "Fix crash cases reported by Sentry",
        "de": "Reparieren Crashfälle gemeldet von Sentry",
        "ru": "Исправление случаев аварии, описанных Sentry",
        "pt": "Corrigir casos de acidente relatados por Sentry",
        "nl": "Vertaling:",
        "fr": "Troubles de crash signalés par Sentry",
        "it": "Correzione dei casi di crash segnalati da Sentry",
        "es": "Casos de accidente fijo reportados por Sentry",
        "pl": "Sprawy katastrofy Fix podane przez Sentry’a",
        "zh-cn": "Sentry所报告的六例事故"
      },
      "2.2.0": {
        "en": "make sure getHistory works for all cases\nAdd option to add comment and user info to results",
        "de": "! Geschichte funktioniert für alle Fälle\nFügen Sie die Option, Kommentare und Benutzerinformationen zu den Ergebnissen hinzuzufügen",
        "ru": "убедитесь, что получите История работает для всех случаев\nДобавить опцию, чтобы добавить комментарий и информацию пользователя к результатам",
        "pt": "certifique-se de obter A história funciona para todos os casos\nAdicionar opção para adicionar comentários e informações do usuário aos resultados",
        "nl": "zorg ervoor dat je ervoor zorgt Geschiedenis werkt voor alle gevallen\nVoeg optie toe om commentaar en gebruikers info toe te voegen aan resultaten",
        "fr": "assure-toi. Histoire fonctionne pour tous les cas\nAjouter l'option pour ajouter des commentaires et des informations utilisateur aux résultats",
        "it": "assicurarsi di ottenere La storia funziona per tutti i casi\nAggiungi l'opzione per aggiungere commento e informazioni utente ai risultati",
        "es": "asegúrese de La historia funciona para todos los casos\nAñadir opción para añadir comentario y información del usuario a los resultados",
        "pl": "upewnić się Historia trwa wszystkie przypadki\nW celu dodania komentarzy i informacji użytkownika do wyników",
        "zh-cn": "确保 历史为所有案件进行工作\n增加评论和用户以成果为目的的选择"
      },
      "2.1.7": {
        "en": "Allow to remove a configuration value for \"round\" in config again",
        "de": "Lassen Sie einen Konfigurationswert für Runde in config wieder entfernen",
        "ru": "Разрешить удалить конфигурационную ценность для раунда в config снова",
        "pt": "Permitir remover um valor de configuração para round em config novamente",
        "nl": "Sta toe om weer een configuratiewaarde te verwijderen voor ronde in het leger",
        "fr": "Permettre de supprimer une valeur de configuration pour round in config à nouveau",
        "it": "Permette di rimuovere un valore di configurazione per round in config di nuovo",
        "es": "Permitir eliminar de nuevo un valor de configuración para redondear en configuración",
        "pl": "Allow, aby usunąć wartość konfiguracyjna w zakręcie ponownie w konfigunie",
        "zh-cn": "允许再次取消一轮谈判的组合价值"
      },
      "2.1.6": {
        "en": "When not count is provided for aggregate \"none\" or \"onchange\" then the limit (default 2000) is used as count to define the number of data to return.",
        "de": "Wenn für die Aggregate keine oder Onchange keine Zählung vorgesehen ist, wird die Grenze (Standard 2000) als Zählung verwendet, um die Anzahl der Daten zu definieren, um zurückzukehren.",
        "ru": "Когда не считать предоставляется для агрегата ни один или онмен, то предел (по умолчанию 2000) используется как считать, чтобы определить количество данных для возврата.",
        "pt": "Quando não a contagem é fornecida para agregar nenhum ou onchange, então o limite (padrão 2000) é usado como contagem para definir o número de dados para retornar.",
        "nl": "Als de tel niet wordt toegewezen voor aggregate noch onchange, dan wordt de limiet 2000 gebruikt om het aantal data te definiëren om terug te keren.",
        "fr": "Lorsqu'il n'y a pas de comptage pour l'agrégat ou le changement, la limite (par défaut 2000) est utilisée pour définir le nombre de données à retourner.",
        "it": "Quando il conteggio non viene fornito per aggregato nessuno o cambio, il limite (default 2000) viene utilizzato come conteggio per definire il numero di dati da restituire.",
        "es": "Cuando no se cuenta se proporciona para agregado ninguno o cambio entonces el límite (por defecto 2000) se utiliza como cuenta para definir el número de datos para regresar.",
        "pl": "Jeśli nieliczanie jest dostarczane dla agregacji ani zmian, to limit (default 2000) jest używany jako określenie liczby danych do powrotu.",
        "zh-cn": "当没有计算总额时,或当时的汇率(2000年)用来确定返回的数据数量。."
      }
    },
    "mode": "daemon",
    "platform": "Javascript/Node.js",
    "loglevel": "info",
    "messagebox": true,
    "subscribe": "messagebox",
    "eraseOnUpload": true,
    "keywords": [
      "charts",
      "history",
      "logging",
      "graphs",
      "Graphen",
      "data",
      "archive"
    ],
    "enabled": true,
    "compact": true,
    "preserveSettings": "custom",
    "authors": [
      "bluefox <dogafox@gmail.com>",
      "hobbyquaker <hq@ccu.io>",
      "Apollon77 <ingo@fischer-ka.de>"
    ],
    "license": "MIT",
    "readme": "https://github.com/ioBroker/ioBroker.history/blob/master/README.md",
    "icon": "history.png",
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.history/master/admin/history.png",
    "type": "storage",
    "supportCustoms": true,
    "getHistory": true,
    "dependencies": [
      {
        "js-controller": ">=3.3.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ],
    "supportStopInstance": 10000,
    "stopTimeout": 10000,
    "docs": {
      "en": [
        "docs/en/README.md"
      ],
      "de": [
        "docs/de/README.md"
      ]
    },
    "plugins": {
      "sentry": {
        "dsn": "https://08fcc63117684cf3af4fa0e551857b5d@sentry.iobroker.net/35"
      }
    },
    "adminUI": {
      "config": "json",
      "custom": "json"
    },
    "connectionType": "none",
    "dataSource": "push",
    "tier": 1,
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<2.0.0",
            "newVersion>=2.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "This new version introduces several changes how values are logged because we fixed several issues and added new features. Please especially check the defined \"debounce\" and \"block time\" settings in your datapoints if values are not logged as expected and make sure the settings make sense. For more details please refer to the changelog and Readme.",
          "de": "Diese neue Version führt mehrere Änderungen ein, wie Werte protokolliert werden, da wir mehrere Probleme behoben und neue Funktionen hinzugefügt haben. Bitte überprüfen Sie insbesondere die definierten „Entprellen“- und „Sperrzeit“-Einstellungen in Ihren Datenpunkten, wenn Werte nicht wie erwartet protokolliert werden, und stellen Sie sicher, dass die Einstellungen sinnvoll sind. Weitere Details finden Sie im Changelog und in der Readme.",
          "ru": "В этой новой версии внесено несколько изменений в регистрацию значений, поскольку мы исправили несколько проблем и добавили новые функции. Пожалуйста, особенно проверьте определенные настройки «debounce» и «block time» в ваших точках данных, если значения не регистрируются должным образом, и убедитесь, что настройки имеют смысл. Для получения более подробной информации, пожалуйста, обратитесь к журналу изменений и Readme.",
          "pt": "Esta nova versão apresenta várias alterações na forma como os valores são registrados, pois corrigimos vários problemas e adicionamos novos recursos. Verifique especialmente as configurações definidas de \"debounce\" e \"block time\" em seus pontos de dados se os valores não forem registrados conforme o esperado e verifique se as configurações fazem sentido. Para obter mais detalhes, consulte o log de alterações e o Leiame.",
          "nl": "Deze nieuwe versie introduceert verschillende wijzigingen in de manier waarop waarden worden geregistreerd, omdat we verschillende problemen hebben opgelost en nieuwe functies hebben toegevoegd. Controleer vooral de gedefinieerde \"debounce\" en \"block time\" instellingen in uw datapunten als de waarden niet zijn vastgelegd zoals verwacht en zorg ervoor dat de instellingen kloppen. Raadpleeg de changelog en Readme voor meer informatie.",
          "fr": "Cette nouvelle version introduit plusieurs changements dans la journalisation des valeurs car nous avons corrigé plusieurs problèmes et ajouté de nouvelles fonctionnalités. Veuillez vérifier en particulier les paramètres \"anti-rebond\" et \"temps de blocage\" définis dans vos points de données si les valeurs ne sont pas enregistrées comme prévu et assurez-vous que les paramètres ont un sens. Pour plus de détails, veuillez consulter le journal des modifications et le fichier Lisez-moi.",
          "it": "Questa nuova versione introduce diverse modifiche al modo in cui i valori vengono registrati perché abbiamo risolto diversi problemi e aggiunto nuove funzionalità. Controllare in particolare le impostazioni definite \"debounce\" e \"block time\" nei propri datapoint se i valori non sono registrati come previsto e assicurarsi che le impostazioni abbiano un senso. Per maggiori dettagli, fare riferimento al log delle modifiche e al Leggimi.",
          "es": "Esta nueva versión introduce varios cambios en la forma en que se registran los valores porque solucionamos varios problemas y agregamos nuevas funciones. Verifique especialmente la configuración definida de \"antirrebote\" y \"tiempo de bloqueo\" en sus puntos de datos si los valores no se registran como se esperaba y asegúrese de que la configuración tenga sentido. Para obtener más detalles, consulte el registro de cambios y el archivo Léame.",
          "pl": "Ta nowa wersja wprowadza kilka zmian w sposobie rejestrowania wartości, ponieważ naprawiliśmy kilka problemów i dodaliśmy nowe funkcje. W szczególności sprawdź zdefiniowane ustawienia „odbicia” i „czasu blokowania” w punktach danych, jeśli wartości nie są rejestrowane zgodnie z oczekiwaniami i upewnij się, że ustawienia mają sens. Aby uzyskać więcej informacji, zapoznaj się z dziennikiem zmian i Readme.",
          "zh-cn": "这个新版本引入了一些更改值的记录方式，因为我们修复了几个问题并添加了新功能。如果未按预期记录值，请特别检查数据点中定义的“去抖动”和“阻塞时间”设置，并确保设置有意义。有关更多详细信息，请参阅更改日志和自述文件。"
        },
        "link": "https://github.com/ioBroker/ioBroker.history/blob/master/docs/en/README.md#settings",
        "level": "warn",
        "linkText": {
          "en": "Readme",
          "de": "Liesmich",
          "ru": "Прочти меня",
          "pt": "Leia-me",
          "nl": "Leesmij",
          "fr": "Lisez-moi",
          "it": "Leggimi",
          "es": "Léame",
          "pl": "Readme",
          "zh-cn": "自述文件"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "maxLength": 960,
    "limit": 2000,
    "storeDir": "",
    "blockTime": 0,
    "debounceTime": 0,
    "retention": 31536000,
    "storeFrom": false,
    "storeAck": true,
    "changesRelogInterval": 0,
    "changesMinDelta": 0,
    "writeNulls": true,
    "disableSkippedValueLogging": false,
    "enableLogging": false,
    "round": "",
    "customRetentionDuration": 365
  },
  "objects": []
}
